Revit 2024 API
AdaptiveComponentFamilyUtils.GetPlacementNumber Method
 Gets Placement number of an Adaptive Placement Point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static int GetPlacementNumber(
	Document doc,
	ElementId refPointId
)
Visual Basic
Public Shared Function GetPlacementNumber ( _
	doc As Document, _
	refPointId As ElementId _
) As Integer
Visual C++
public:
static int GetPlacementNumber(
	Document^ doc,
	ElementId^ refPointId
)
Parameters
doc
Type: Autodesk.Revit.DB.Document
 The Document
refPointId
Type: Autodesk.Revit.DB.ElementId
 The ReferencePoint id
Return Value
 Placement number of the Adaptive Placement Point.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The ElementId refPointId does not correspond to a valid ReferencePoint. -or- The Element corresponding to ElementId refPointId does not belong to an Adaptive Family. -or- The ElementId refPointId does not correspond to an Adaptive Placement Point.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
AdaptiveComponentFamilyUtils Class
Autodesk.Revit.DB Namespace